Revit 2027 API
DoubleClickAction Enumeration
 Possible actions Revit can take in response to the user double-clicking on an element.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum DoubleClickAction
Public Enumeration DoubleClickAction
public enum class DoubleClickAction
type DoubleClickAction
Members
Member name | Value | Description
ActivateView | 3 |  Double-click should activate the view.
DeactivateView | 5 |  Double-click should deactivate the active view.
EditFamily | 1 |  Double-click should open the family for editing.
EditSchedule | 6 |  Double-click should edit the schedule.
EditType | 2 |  Double-click should take the user to the edit type dialog.
EnterEditMode | 4 |  Double-click will enter a specific edit mode for the element.
NoAction | 0 |  Double-clicks should be ignored.
OpenView | 8 |  Double-Click should open the view.
Rename | 7 |  Slow double-click should rename the item.
See Also
Reference
Autodesk.Revit.UI Namespace